{"pageProps":{"post":{"_createdAt":"2022-06-16T12:53:45Z","_id":"b2675e7a-c9cd-458e-ac74-a4c8360f9b7a","author":{"image":{"_type":"image","asset":{"_ref":"image-339f8e320ddfad52225d31a181b162996e1c02d1-876x876-png","_type":"reference"}},"name":"👾 Game Master"},"body":[{"_key":"d2bb5f8db24f","_type":"block","children":[{"_key":"abc98be3273e0","_type":"span","marks":[],"text":"What is Corporate Valuation?"}],"markDefs":[],"style":"h2"},{"_key":"f34a795c712e","_type":"block","children":[{"_key":"023423dc66b30","_type":"span","marks":[],"text":"In corporate finance, valuation means the calculation of the value of a company or an asset. In other words, we determine whether a company is correctly valued by the market. If a company is undervalued by the market, meaning there is potential for the company’s price to grow in the future, we can buy the stock until it hits our anticipating price. On the other hand, if a company is overvalued by the market, we might potentially either sell its stock or hold a short position ("},{"_key":"023423dc66b31","_type":"span","marks":["c82284c81ba1"],"text":"Long and Short Positions"},{"_key":"023423dc66b32","_type":"span","marks":[],"text":"), expecting to make a profit. However, it is also important to understand that overvaluation or undervaluation does not directly link to the performance of a stock in the future since valuations are often subject to many variables and external conditions."}],"markDefs":[{"_key":"c82284c81ba1","_type":"link","href":"https://www.notion.so/Long-and-Short-Positions-6a2c63ac1a7743b9ba5ff2e76ae3adc0"}],"style":"normal"},{"_key":"c08e67a0710b","_type":"image","asset":{"_ref":"image-802c7a34249ce935232dd13743c852e9ee13f2a8-1280x720-png","_type":"reference"}},{"_key":"31053ce2047c","_type":"block","children":[{"_key":"4295fc2a2a640","_type":"span","marks":[],"text":"How Do We Value a Company?"}],"markDefs":[],"style":"h2"},{"_key":"4ead275de81d","_type":"block","children":[{"_key":"83a5536f4fcc0","_type":"span","marks":[],"text":"There are two main ways to value a company: intrinsic valuation and relative valuation. Intrinsic valuation calculates the “true” value of a company, independent of market conditions and sentiments. Intrinsic valuation methods include Discounted Cash Flow (DCF) valuation and Dividend Discount Model (DDM) Valuation. Relative valuation reflects how much a company should be valued based on some relative measures, such as comparable companies or precedent transactions."}],"markDefs":[],"style":"normal"},{"_key":"a67f30178083","_type":"block","children":[{"_key":"141948dec9920","_type":"span","marks":[],"text":"In this section, several metrics and ratios under both relative and intrinsic valuation categories will be introduced. Although calculating ratios can be a fast and convenient approach to company valuation, most ratios could be biased since they often merely consider one aspect of a company. At the end of this section, a detailed tutorial on how to analyze the three financial statements through Excel will be provided. After that, a tutorial on the DCF model will be offered. By the end of this section, you will build a fundamental understanding of the valuation methods and will be able to perform some valuation strategies on your own."}],"markDefs":[],"style":"normal"}],"comments":[],"description":"Introduction to corporate valuation.","mainImage":{"_type":"image","asset":{"_ref":"image-beb1a15eaedb890d161fc4db99b2c3e5aa0f8de1-904x600-png","_type":"reference"}},"slug":{"_type":"slug","current":"corporate-valuation-overview"},"title":"Corporate Valuation Overview"}},"__N_SSG":true}