{"pageProps":{"post":{"_createdAt":"2022-06-30T18:04:18Z","_id":"a0cd6305-7e17-42f2-a9af-2f8fc26df865","author":{"image":{"_type":"image","asset":{"_ref":"image-b0708b93d42c84d8a99836bfe6622fcaa457099d-744x692-png","_type":"reference"}},"name":"Schneider the \"Money Creator\""},"body":[{"_key":"14aa9909ea2e","_type":"block","children":[{"_key":"3e7caae30242","_type":"span","marks":["strong"],"text":"What is happening to the retail industry?"}],"markDefs":[],"style":"h1"},{"_key":"cdb54bfe331c","_type":"block","children":[{"_key":"beb9e3ee4855","_type":"span","marks":[],"text":"Cosmetics line Revlon filed for Chapter 11 bankruptcy protection last week, while it largely would not be the single case. The retail industry is facing a possible wave of bankruptcies due to excessive inventories and rising prices that suppress consumer demands."}],"markDefs":[],"style":"normal"},{"_key":"9a025245b1d6","_type":"image","asset":{"_ref":"image-4037eaba63fee364ba750f03b896afab0a282f11-1536x864-png","_type":"reference"}},{"_key":"e9ebc80d94d9","_type":"block","children":[{"_key":"30c2d24b98b3","_type":"span","marks":["c75f3d4413fa"],"text":"Source: InvestorPlace"}],"markDefs":[{"_key":"c75f3d4413fa","_type":"link","href":"https://investorplace.com/2022/06/revlon-is-bankrupt-what-comes-next-for-rev-stock/"}],"style":"normal"},{"_key":"7854a7c095e0","_type":"block","children":[{"_key":"3189c5fc240a","_type":"span","marks":[],"text":"After experiencing the supply shortages in the midst of Covid, retail companies piled up inventories in response to the increasing demand as the economy started to recover. However, not all the forecasts and judgments made by companies were accurate. Many retailers failed to acknowledge the shift in consumers’ habits. For Macy’s, the percentage of missing orders drops from 30 percent last year to 20 percent, still resulting in extra inventories sitting in warehouses. In addition, the longer lead time required by manufacturers blows the industry as well. Companies need to order much earlier compared to the pre-pandemic level and thus more vulnerable to shifts in consumer preferences."}],"markDefs":[],"style":"normal"},{"_key":"9368dc7e2ea9","_type":"block","children":[{"_key":"fe129a9827c3","_type":"span","marks":[],"text":"Based on a survey NPD Group issued, consumers bought 6% fewer items at retail in the first quarter of 2022 relative to the first quarter of 2021. More than 80% of consumers in the survey said they planned to spend even less in the next six months."}],"markDefs":[],"style":"normal"},{"_key":"9b56b0d3a3f9","_type":"block","children":[{"_key":"7d3e662506c7","_type":"span","marks":[],"text":"If the inventory problem does not ease while consumers hold back their spending, more retailers will be pushed to the verge of bankruptcy."}],"markDefs":[],"style":"normal"},{"_key":"7d5825dae74d","_type":"block","children":[{"_key":"7d1a039ffd79","_type":"span","marks":[],"text":"Some well-known retail companies facing the most danger of bankruptcy are mattress maker Serta Simmons, cosmetics business Anastasia Beverly Hills, and clothing chain Men’s Warehouse."}],"markDefs":[],"style":"normal"},{"_key":"5c32b8dd61de","_type":"block","children":[{"_key":"edd54d637d32","_type":"span","marks":[],"text":"Does filing bankruptcy necessarily mean the closure of a company?"}],"markDefs":[],"style":"h1"},{"_key":"6933c38ebbff","_type":"block","children":[{"_key":"c432af4ef165","_type":"span","marks":[],"text":"The short answer is NO. When companies are not able to pay back their debts, they file for Chapter 7 or Chapter 11 bankruptcy. In a Chapter 7 bankruptcy, companies cease the operation and go out of the business completely, and the assets of companies will be sold to pay off their debts. Under a Chapter 11 bankruptcy, the situation is different as companies are allowed to continue their operation and reorganize. Companies that file Chapter 11 bankruptcy generally need more time to manage their debt and hope for a revival."}],"markDefs":[],"style":"normal"},{"_key":"6c1a3021557a","_type":"block","children":[{"_key":"8e604e40a607","_type":"span","marks":[],"text":"Opinions"}],"markDefs":[],"style":"h1"},{"_key":"e47e0cf847a6","_type":"block","children":[{"_key":"38ed42bb4cad","_type":"span","marks":[],"text":"Writer’s view"}],"markDefs":[],"style":"h2"},{"_key":"f37db8094030","_type":"block","children":[{"_key":"9082cd29819f","_type":"span","marks":[],"text":"Retailers need to be flexible and be prepared for various demands from the consumer end and any challenging situation that may emerge in the next year. Also, digitization should be something on every retailer’s calendar. Retailers have to shift from brick-and-mortar stores to digitized platforms. The change to their cost structure may be necessary to put this transformation into practice. Accurate and sophisticated analytics to forecast market demand and possible interruptions are needed, so retailers can allocate their costs and manage inventories in an efficient manner while increasing their resilience to unexpected events."}],"markDefs":[],"style":"normal"},{"_key":"00d3148a82f7","_type":"block","children":[{"_key":"a23f28e0fcf0","_type":"span","marks":[],"text":"Authority’s view"}],"markDefs":[],"style":"h2"},{"_key":"9205d7d3a479","_type":"block","children":[{"_key":"871f8d400ee8","_type":"span","marks":[],"text":"According to Ian Fredericks, president of Hilco Global’s retail group, retail bankruptcies probably will remain a problem until 2023. He suggests that retailers are not under full stress now as they still have some cash sitting in their accounts. The upcoming holiday season will be a critical moment for these retailers as consumers do not show strong demand for purchasing."}],"markDefs":[],"style":"normal"},{"_key":"eb210a5e0b67","_type":"block","children":[{"_key":"b65d94e7440c","_type":"span","marks":[],"text":"Perry Mandarino, co-head of investment banking and head of corporate restructuring at B. Riley Securities, added that resulting from the slowdown of the economy, giant retailers may look for small firms for M&A purposes at a discount price. Such an inorganic strategy is what these giants use during hard times to boost their revenues. Based on his prediction, home goods, apparel, and department stores are the ones under the most pressure in the upcoming months."}],"markDefs":[],"style":"normal"}],"comments":[],"description":"A snapshot of the retail industry for post-COVID situation.","mainImage":{"_type":"image","asset":{"_ref":"image-0405df2a0c3f35d7bdf6c1ccf0b66a08205830e0-1200x800-jpg","_type":"reference"}},"slug":{"_type":"slug","current":"bankruptcy-may-hit-the-retail-industry"},"title":"Bankruptcy May Hit the Retail Industry"}},"__N_SSG":true}