{"pageProps":{"post":{"_createdAt":"2022-06-30T18:19:15Z","_id":"71c23394-1c51-42fb-842a-751d45e3959b","author":{"image":{"_type":"image","asset":{"_ref":"image-59b618a84f64169b0adc1104a2671e6860801d39-538x532-png","_type":"reference"}},"name":"Friday the “Bullish Queen”"},"body":[{"_key":"94024f3b1b3e","_type":"block","children":[{"_key":"c5daebe5ef4a0","_type":"span","marks":[],"text":"History of Astral"}],"markDefs":[],"style":"h1"},{"_key":"22ee36929695","_type":"block","children":[{"_key":"c300815c8280","_type":"span","marks":[],"text":"It's no secret that the electric vehicle industry is on the rise, and Astral Company Limited (ticker: AST) is poised to be at the forefront of this exciting and rapidly-growing market. As a leading car manufacturer with a strong focus on innovative technologies, Astral has consistently set itself apart from the competition, and the recent huge government subsidy it has received is a testament to this."}],"markDefs":[],"style":"normal"},{"_key":"d0b62ebb9478","_type":"block","children":[{"_key":"a2714320a468","_type":"span","marks":[],"text":"\nAstral's journey to becoming a leader in the electric vehicle industry has been a challenging one. Founded as a traditional automotive company, Astral faced fierce competition from established players in the industry. However, with a commitment to innovation and a willingness to take risks, the company has managed to carve out a niche for itself."}],"markDefs":[],"style":"normal"},{"_key":"f30873d79d5c","_type":"block","children":[{"_key":"deb170333477","_type":"span","marks":[],"text":"\nIn recent years, Astral has made a strategic decision to invest heavily in its electric vehicle and battery business segments. This has paid off in a big way, as the company has seen a significant increase in electric vehicle sales and has established itself as a leader in this space."}],"markDefs":[],"style":"normal"},{"_key":"40bac141f4cc","_type":"block","children":[{"_key":"4770503a4f19","_type":"span","marks":[],"text":""}],"markDefs":[],"style":"normal"},{"_key":"50fcf0eb4c88","_type":"block","children":[{"_key":"6fce01221e2f","_type":"span","marks":[],"text":"Government Subsidy"}],"markDefs":[],"style":"h1"},{"_key":"94faad28e8dc","_type":"block","children":[{"_key":"581a395497b8","_type":"span","marks":[],"text":"The government subsidy that Astral has received will provide a major boost to the company's electric vehicle and battery business segments. This funding will allow Astral to ramp up production and bring new, cutting-edge products to market faster. It will also help the company to compete more effectively with other major players in the industry."}],"markDefs":[],"style":"normal"},{"_key":"f82128330961","_type":"block","children":[{"_key":"d36144d27bf0","_type":"span","marks":[],"text":""}],"markDefs":[],"style":"normal"},{"_key":"5dd632f8b0a1","_type":"block","children":[{"_key":"3025fb05e135","_type":"span","marks":[],"text":"Extension"}],"markDefs":[],"style":"h1"},{"_key":"7885e61b0576","_type":"block","children":[{"_key":"aba845c9fbd5","_type":"span","marks":[],"text":"But the benefits of this subsidy extend far beyond just Astral. The electric vehicle industry as a whole stands to benefit from this influx of funding, as it will help to accelerate the development and deployment of electric vehicles. This is great news for the environment, as electric vehicles are a much cleaner and more sustainable transportation option than traditional gasoline-powered cars."}],"markDefs":[],"style":"normal"},{"_key":"f2a2682a3b8b","_type":"block","children":[{"_key":"66e2b74f2ee6","_type":"span","marks":[],"text":"\nIn addition to the environmental benefits, the growth of the electric vehicle industry is also good news for the economy. As demand for electric vehicles increases, it will create new jobs and stimulate economic growth. This is particularly important as we continue to recover from the economic downturn caused by the COVID-19 pandemic."}],"markDefs":[],"style":"normal"},{"_key":"b80eb2274bd3","_type":"block","children":[{"_key":"9c4f092053ba","_type":"span","marks":[],"text":"\nThe news of the government subsidy received by Astral is extremely positive, and it's no wonder that the company's stock price has been on the rise as a result. This is a clear indication that the government recognizes the value of Astral's innovative technologies and is committed to supporting the growth of the electric vehicle industry."}],"markDefs":[],"style":"normal"},{"_key":"2eb38d5b673a","_type":"block","children":[{"_key":"15e1c0de5fb6","_type":"span","marks":[],"text":"\nIn conclusion, the government subsidy received by Astral is a major milestone for the company and a clear indication of the government's support for the electric vehicle industry. This is great news for Astral and its shareholders, and it's likely that the company's stock price will continue to surge as a result of this positive development. It is also a win for the environment and the economy, as the growth of the electric vehicle industry will bring numerous benefits to society as a whole."}],"markDefs":[],"style":"normal"},{"_key":"8af9f9342c2d","_type":"block","children":[{"_key":"4506b45fdcdf","_type":"span","marks":[],"text":""}],"markDefs":[],"style":"normal"},{"_key":"7dfd4a8bc639","_type":"block","children":[{"_key":"01561b84b4df","_type":"span","marks":[],"text":""}],"markDefs":[],"style":"normal"},{"_key":"57b6577b9197","_type":"image","asset":{"_ref":"image-47546a76a36e6e35386e07fbb7b645b7375968c5-2121x1414-webp","_type":"reference"}}],"categories":{"_key":"830d8448086c","_ref":"c523a11c-4a72-4328-a43a-d3b94dd60a8b","_type":"reference"},"comments":[],"description":"Subsidy allowing Astral to ramp up production and bring new products to market faster.","mainImage":{"_type":"image","asset":{"_ref":"image-85fef72a7d4b7db2c8ae0bb1e78220e2bf0dfc71-1116x620-png","_type":"reference"}},"slug":{"_type":"slug","current":"ast-received-huge-government-subsidy-for-electric-vehicle-and-battery-business-stock-price"},"title":"AST Received Huge Government Subsidy for Electric Vehicle and Battery Business"}},"__N_SSG":true}