{"pageProps":{"post":{"_createdAt":"2022-06-30T18:31:52Z","_id":"6102831c-7420-4917-a8ae-90ba25a68233","author":{"image":{"_type":"image","asset":{"_ref":"image-b0708b93d42c84d8a99836bfe6622fcaa457099d-744x692-png","_type":"reference"}},"name":"Schneider the \"Money Creator\""},"body":[{"_key":"6adf59d441ca","_type":"block","children":[{"_key":"81e191631e4c0","_type":"span","marks":[],"text":"A Smart Move or a Mistake?"}],"markDefs":[],"style":"h1"},{"_key":"2eb3ad0bb115","_type":"block","children":[{"_key":"d1b254bc9e2d0","_type":"span","marks":[],"text":"Doshacom Group, a leading provider of telecommunications, media, and technology services, has recently made a major acquisition in the form of Celcomedia, a company that provides cable TV and broadband services. While this acquisition may seem like a smart move on the surface, a closer look reveals that it could be a major misstep for Doshacom."}],"markDefs":[],"style":"normal"},{"_key":"fc5f1b702b3e","_type":"block","children":[{"_key":"4fe1601f951a0","_type":"span","marks":[],"text":"One of the main reasons for this pessimism is the fact that the telecommunications industry is rapidly changing. With the proliferation of streaming services and the increasing reliance on mobile data, traditional cable TV and broadband providers are struggling to keep up. In contrast, companies that are focused on these newer technologies are seeing strong growth."}],"markDefs":[],"style":"normal"},{"_key":"d2ee819a1cd5","_type":"block","children":[{"_key":"7ab8d4212d900","_type":"span","marks":[],"text":"Given this context, it's hard to see how the acquisition of Celcomedia will benefit Doshacom in the long run. While it may provide a short-term boost to the company's revenue, it's unlikely to be a sustainable source of growth. In fact, it's quite possible that the acquisition will weigh on Doshacom's bottom line as the company struggles to keep up with changing consumer habits."}],"markDefs":[],"style":"normal"},{"_key":"c04b68407451","_type":"block","children":[{"_key":"4f4b3409c5150","_type":"span","marks":[],"text":"Lesson From Vodafone"}],"markDefs":[],"style":"h1"},{"_key":"8c05eac5b8a0","_type":"block","children":[{"_key":"5cdaa547c2a50","_type":"span","marks":[],"text":"Another reason to be pessimistic about this acquisition is the fact that it's reminiscent of Vodafone's acquisition of Liberty Global. Like Celcomedia, Liberty Global was a traditional cable TV and broadband provider that was struggling to adapt to the changing landscape of the telecommunications industry. Vodafone's acquisition of the company was widely hailed as a smart move at the time, but in hindsight it's clear that it was a major misstep. Vodafone has struggled to integrate Liberty Global and has seen its stock price suffer as a result."}],"markDefs":[],"style":"normal"},{"_key":"ee3605140b08","_type":"block","children":[{"_key":"22975eadfbc00","_type":"span","marks":[],"text":"Conclusion"}],"markDefs":[],"style":"h1"},{"_key":"42964c6eaa2f","_type":"block","children":[{"_key":"8f58bc183ce90","_type":"span","marks":[],"text":"Given these reasons, it's hard to be optimistic about Doshacom's acquisition of Celcomedia. While it may provide a short-term boost to the company's revenue, it's unlikely to be a sustainable source of growth. In fact, it's quite possible that this acquisition will weigh on Doshacom's bottom line and ultimately lead to a decrease in the company's stock price."}],"markDefs":[],"style":"normal"},{"_key":"09bf7bf3a518","_type":"block","children":[{"_key":"d6a8d28f57f20","_type":"span","marks":[],"text":"In conclusion, while the acquisition of Celcomedia may seem like a smart move on the surface, a closer look reveals that it could be a major misstep for Doshacom. With the telecommunications industry rapidly changing and traditional cable TV and broadband providers struggling to keep up, it's hard to see how this acquisition will benefit Doshacom in the long run. Given these reasons, it's likely that Doshacom's stock will decrease as a result of this acquisition."}],"markDefs":[],"style":"normal"}],"categories":{"_key":"7ed6f0ea9915","_ref":"c523a11c-4a72-4328-a43a-d3b94dd60a8b","_type":"reference"},"comments":[],"description":"The acquisition may not be a smart move...","mainImage":{"_type":"image","asset":{"_ref":"image-09df2a7bbb210c1ce0ff6bb0752244e6fe840ed9-1220x708-png","_type":"reference"}},"slug":{"_type":"slug","current":"doshacom-group-s-risky-bet-on-celcomedia"},"title":"Doshacom Group's Risky Bet on Celcomedia"}},"__N_SSG":true}