{"pageProps":{"post":{"_createdAt":"2022-12-28T21:39:06Z","_id":"600aa16a-6233-40b4-87bc-5358b1821fd1","author":{"image":{"_type":"image","asset":{"_ref":"image-59b618a84f64169b0adc1104a2671e6860801d39-538x532-png","_type":"reference"}},"name":"Friday the “Bullish Queen”"},"body":[{"_key":"ef75f5a3598a","_type":"block","children":[{"_key":"768301151e920","_type":"span","marks":[],"text":"Mysterious Infection"}],"markDefs":[],"style":"h1"},{"_key":"dd336aa19805","_type":"block","children":[{"_key":"a4674d7f2d430","_type":"span","marks":[],"text":"A mysterious illness has recently been reported in Canada, leaving many experts and concerned citizens alike searching for answers. According to those affected, the illness is a psychological sickness that has been attributed to the popular Metaverse-based game \"Tomorrow Night.\""}],"markDefs":[],"style":"normal"},{"_key":"9c9410637410","_type":"block","children":[{"_key":"63eff9d9ebe60","_type":"span","marks":[],"text":"Symptoms of the illness include severe headaches, illusions of colored characters, and a strong echo in the head that seems to exacerbate the condition. These symptoms have caused a great deal of distress for those affected, as they struggle to understand what is happening to their bodies and minds."}],"markDefs":[],"style":"normal"},{"_key":"4616eff54076","_type":"block","children":[{"_key":"b667bb45d16a0","_type":"span","marks":[],"text":"So far, there has been no scientific or biological research to prove the existence of this illness, and hospitals in Canada are working hard to try to solve the mystery. It's unclear at this time what the cause of the illness might be, but many are speculating that it could be related to the immersive nature of the \"Tomorrow Night\" game and the potential for extended periods of play."}],"markDefs":[],"style":"normal"},{"_key":"8f59e30f2913","_type":"block","children":[{"_key":"321e2dbb43d20","_type":"span","marks":[],"text":"Effects On the Stock Market"}],"markDefs":[],"style":"h1"},{"_key":"30a6bd81ca6f","_type":"block","children":[{"_key":"98ad97ca2b310","_type":"span","marks":[],"text":"The potential impact of this illness on the stock market cannot be ignored. Many technology stocks, including the newly IPO company Wakron, have encountered huge drops in stock price due to the uncertainty surrounding the illness. This has caused concern among investors and has led to a general sense of unease in the market."}],"markDefs":[],"style":"normal"},{"_key":"89ca940c4c45","_type":"block","children":[{"_key":"277f634e2c0a0","_type":"span","marks":[],"text":"While it's natural to be concerned about the potential consequences of this mysterious illness, it's important to remember that it has only infected a few hundred people at this point. While it's certainly cause for concern, it's likely that the stock market will recover once more information about the illness is made available to the public."}],"markDefs":[],"style":"normal"},{"_key":"9e59b64eab5e","_type":"block","children":[{"_key":"5631952ae0d50","_type":"span","marks":[],"text":"Stay Healthy!"}],"markDefs":[],"style":"h1"},{"_key":"368dbb4fce27","_type":"block","children":[{"_key":"32da65ac9d320","_type":"span","marks":[],"text":"In the meantime, it's important to stay informed and take any necessary precautions to protect ourselves and our loved ones. While it may be tempting to panic, it's important to remain calm and trust that the experts working on the case will be able to find a solution. With this in mind, it's reasonable to remain optimistic and believe that the stock market will eventually bounce back."}],"markDefs":[],"style":"normal"},{"_key":"77dcc77709c7","_type":"block","children":[{"_key":"d33cdef403200","_type":"span","marks":[],"text":"As the investigation into this mysterious illness continues, it's important to remember that we are not alone in this situation. The Canadian healthcare system is working hard to find answers and provide support to those affected by the illness. It's also important to recognize the potential risks associated with extended periods of play on immersive virtual reality games, and to be mindful of our own health and well-being while engaging with these types of activities."}],"markDefs":[],"style":"normal"},{"_key":"29eb035eeedd","_type":"block","children":[{"_key":"f3a0421698ee0","_type":"span","marks":[],"text":"Ultimately, it's too early to say what the long-term consequences of this illness might be. But with the support of the healthcare system and the general public, it's likely that we will eventually find a solution and move past this difficult time."}],"markDefs":[],"style":"normal"},{"_key":"5a13352ddb17","_type":"block","children":[{"_key":"424dbbc332ea0","_type":"span","marks":[],"text":"Friday the “Bullish Queen” will keep tracking the progress of this mysterious illness and will report if new situations occurred!"}],"markDefs":[],"style":"normal"}],"categories":{"_key":"09771f18dda8","_ref":"c72dcce9-ace8-409b-b959-6987563a04ce","_type":"reference"},"comments":[],"description":"Sudden illness that infected Canadian players.","mainImage":{"_type":"image","asset":{"_ref":"image-b924bb74a2b3cf63063d96707c935a4e4281cf6c-940x520-png","_type":"reference"}},"slug":{"_type":"slug","current":"game-over-mysterious-illness-plagues-players-of-tomorrow-night-in-canada"},"title":"Game Over? Mysterious Illness Plagues Players of \"Tomorrow Night\" in Canada"}},"__N_SSG":true}