{"pageProps":{"post":{"_createdAt":"2022-06-19T05:15:00Z","_id":"f1fa0c50-3d7a-42ae-a2d7-221ef815fc7c","author":{"image":{"_type":"image","asset":{"_ref":"image-59b618a84f64169b0adc1104a2671e6860801d39-538x532-png","_type":"reference"}},"name":"Friday the “Bullish Queen”"},"body":[{"_key":"1ee32b017d34","_type":"block","children":[{"_key":"163d113080920","_type":"span","marks":[],"text":"Wakron’s Valuation History"}],"markDefs":[],"style":"h1"},{"_key":"5c0878304ac5","_type":"block","children":[{"_key":"16a9ebc404950","_type":"span","marks":[],"text":"Wakron, a leading technology company, has recently gone public with its initial public offering (IPO) after years of resistance from CEO James Hendrix. Hendrix had previously promised to keep the company private in order to maintain high product quality and avoid potential chaos from public trading. In fact, Wakron even rejected a $6 billion offer from telecommunications giant Doshapone in an effort to stay private. However, the company did accept several investments in recent years, including a 5% stake for $750 million in 2063 and a 1.5% stake for $405 million in 2068, which caused fluctuations in Wakron's valuation ($20 billion and $27 billion, respectively)."}],"markDefs":[],"style":"normal"},{"_key":"f4c369f10b09","_type":"block","children":[{"_key":"ec2207ac3b640","_type":"span","marks":["em"],"text":"Term Definition: Initial Public Offering"}],"markDefs":[],"style":"h2"},{"_key":"b4b351a49691","_type":"block","children":[{"_key":"ef069237c2310","_type":"span","marks":[],"text":"When a private company eventually gained stable and solid fundamentals (typically when reaching a valuation of $1 billion, AKA a unicorn status), it is qualified to be listed and go public. Yet, many currently listed stocks did not fulfill this standard (in fact plenty of the companies on NASDAQ didn’t reach this standard), therefore this is a standard but not a must-fulfilled condition. Then, if the company is willing to go public and IPO-ready, it can go through the IPO process."}],"markDefs":[],"style":"normal"},{"_key":"0fa5c8f587c6","_type":"block","children":[{"_key":"8ed2981e4e080","_type":"span","marks":[],"text":"IPO is a big step in the growth of a company, as it represents a huge step forward and an opportunity for expansion. But at the same time, transparency is expected to increase to meet the credibility requirement. The process of IPO is often supervised by the Securities and Exchange Commission (SEC) to make sure it is credible, unbiased, and transparent."}],"markDefs":[],"style":"normal"},{"_key":"33538fc8295e","_type":"block","children":[{"_key":"b11a480d28690","_type":"span","marks":[],"text":"The value and share prices of the company are both defined by the companies, their underwriters, and the investors during their roadshows (which is a series of meetings during the IPO for the companies to talk with their potential investors). After going public, the private shares of the company will also turn public and can be traded according to its share prices. Listed as a public company means a huge opportunity for millions of investors to purchase the shares, providing capital to the company."}],"markDefs":[],"style":"normal"},{"_key":"a7069a2d3fa1","_type":"block","children":[{"_key":"91abce876c910","_type":"span","marks":[],"text":"A Compromise? Going Public…"}],"markDefs":[],"style":"h1"},{"_key":"6838c1a1464c","_type":"block","children":[{"_key":"d298872c8c130","_type":"span","marks":[],"text":"Despite Hendrix's initial resistance to going public, Wakron faced pressure from shareholders and the Securities and Exchange Commission (SEC) in the past few years. As the company's shareholder base grew and its structure became more complex, Hendrix eventually announced that Wakron was considering an IPO. News of the company's plans to go public spread in January 2072, causing speculation and excitement among individual investors. Some predicted that Wakron's IPO would be one of the biggest in history, while financial analysts had mixed opinions about the company's performance on its first trading day."}],"markDefs":[],"style":"normal"},{"_key":"7468d4210271","_type":"block","children":[{"_key":"c865c93498c20","_type":"span","marks":[],"text":"Controversies"}],"markDefs":[],"style":"h1"},{"_key":"7b97f390f902","_type":"block","children":[{"_key":"7b8fb57d52c80","_type":"span","marks":[],"text":"In April, both the Financial Daily News and investment bank Jilepy released optimistic reports about Wakron, indicating a bullish outlook from the fundamental side. However, it's important for investors to do their own research and exercise caution when making any investment decisions, especially in the volatile tech industry. While Wakron's successful IPO and strong financial performance are promising signs, it's important to stay informed and consider all factors before making an investment. Since in addition to the risks inherent in the tech industry, it's also important for investors to consider the specific risks associated with investing in a newly public company. As a newly public company, Wakron may face additional challenges as it adjusts to being a publicly-traded company and navigates the regulatory landscape. Investors should carefully consider these risks and do their own due diligence before making any investment decisions."}],"markDefs":[],"style":"normal"}],"categories":{"_key":"218a504e304f","_ref":"c523a11c-4a72-4328-a43a-d3b94dd60a8b","_type":"reference"},"comments":[],"description":"Pre-IPO prediction and summary.","mainImage":{"_type":"image","asset":{"_ref":"image-f8439ae9179bce956db6a6e764fb27f75a20bc52-960x536-png","_type":"reference"}},"slug":{"_type":"slug","current":"wakron-s-wild-ride-tech-company-s-ipo-brings-excitement-and-risks"},"title":"Wakron's Wild Ride: Tech Company's IPO Brings Excitement and Risks"}},"__N_SSG":true}